In [1]:
import pandas as pd

In [21]:
df = pd.read_csv('customer.csv')
df

   Unnamed: 0  ID         Name  Age      City  Purchase_Amount
0           0   1   Customer_1   44   Chicago           175.08
1           1   2   Customer_2   53  New York           301.74
2           2   3   Customer_3   25   Houston           353.85
3           3   4   Customer_4   26   Phoenix           735.50
4           4   5   Customer_5   47   Houston           219.66
5           5   6   Customer_6   69   Houston           837.42
6           6   7   Customer_7   36   Phoenix           681.78
7           7   8   Customer_8   44   Houston           926.90
8           8   9   Customer_9   52   Houston           525.23
9           9  10  Customer_10   40  New York           471.29

# **Math Operations**

## **Operations in column**

In [5]:
# select a column and calculate total sum
df['Purchase_Amount'].sum()

np.float64(5228.45)

In [15]:
# count
df['Purchase_Amount'].count()

175.08

In [17]:
# mean
df['Purchase_Amount'].mean()

np.float64(522.845)

In [18]:
# std
df['Purchase_Amount'].std()

263.6648406278951

In [19]:
#max 
df['Purchase_Amount'].max()

926.9

In [20]:
#min

df['Purchase_Amount'].min()

175.08

In [11]:
# doing the same with .describe()
df['Purchase_Amount'].describe()

count     10.000000
mean     522.845000
std      263.664841
min      175.080000
25%      314.767500
50%      498.260000
75%      722.070000
max      926.900000
Name: Purchase_Amount, dtype: float64

In [16]:
df.describe()

       Unnamed: 0        ID        Age  Purchase_Amount
count    10.00000  10.00000  10.000000        10.000000
mean      4.50000   5.50000  43.600000       522.845000
std       3.02765   3.02765  13.091134       263.664841
min       0.00000   1.00000  25.000000       175.080000
25%       2.25000   3.25000  37.000000       314.767500
50%       4.50000   5.50000  44.000000       498.260000
75%       6.75000   7.75000  50.750000       722.070000
max       9.00000  10.00000  69.000000       926.900000

## **Operations in Rows**

In [22]:
# calculate the sum in a row
df['Age'] + df['Purchase_Amount']

0    219.08
1    354.74
2    378.85
3    761.50
4    266.66
5    906.42
6    717.78
7    970.90
8    577.23
9    511.29
dtype: float64

In [23]:
# calculating the average and assigning the result to a new column
df['average'] =(df['Age'] + df['Purchase_Amount'])/2

In [24]:
df

   Unnamed: 0  ID         Name  Age      City  Purchase_Amount  average
0           0   1   Customer_1   44   Chicago           175.08  109.540
1           1   2   Customer_2   53  New York           301.74  177.370
2           2   3   Customer_3   25   Houston           353.85  189.425
3           3   4   Customer_4   26   Phoenix           735.50  380.750
4           4   5   Customer_5   47   Houston           219.66  133.330
5           5   6   Customer_6   69   Houston           837.42  453.210
6           6   7   Customer_7   36   Phoenix           681.78  358.890
7           7   8   Customer_8   44   Houston           926.90  485.450
8           8   9   Customer_9   52   Houston           525.23  288.615
9           9  10  Customer_10   40  New York           471.29  255.645